bobmittmann/thinkos/sdk/include/stm32f/stm32f-dma.h
/* 
 * Copyright(C) 2012 Robinson Mittmann. All Rights Reserved.
 * 
 * This file is part of the libstm32f.
 *
 * This library is free software; you can redistribute it and/or
 * modify it under the terms of the GNU Lesser General Public
 * License as published by the Free Software Foundation; either
 * version 3.0 of the License, or (at your option) any later version.
 * 
 * This library is distributed in the hope that it will be useful,
 * but WITHOUT ANY WARRANTY; without even the implied warranty of
 * MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the GNU
 * Lesser General Public License for more details.
 * 
 * You can receive a copy of the GNU Lesser General Public License from 
 * http://www.gnu.org/
 */

/** 
 * @file stm32f-dma.h
 * @brief
 * @author Robinson Mittmann <bobmittmann@gmail.com>
 */ 

#ifndef __STM32F_DMA_H__
#define __STM32F_DMA_H__

/*-------------------------------------------------------------------------
  Direct Memory Access Controller (DMA)
  -------------------------------------------------------------------------*/

#if defined(STM32F2X) || defined(STM32F4X)

/* DMA low interrupt status register */
#define STM32F_DMA_LISR 0x000

/* Bits 31:28, 15:12 Reserved, always read as 0. */

/* Stream x transfer complete interrupt flag (x = 3..0) */
#define DMA_TCIF3 (1 << 27)
#define DMA_TCIF2 (1 << 21)
#define DMA_TCIF1 (1 << 11)
#define DMA_TCIF0 (1 << 5)
/* This bit is set by hardware. It is cleared by software writing 1 to the 
   corresponding bit in the DMA_LIFCR register.
	0: No transfer complete event on stream x
	1: A transfer complete event occurred on stream x */

/* Stream x half transfer interrupt flag (x=3..0) */
#define DMA_HTIF3 (1 << 26)
#define DMA_HTIF2 (1 << 20)
#define DMA_HTIF1 (1 << 10)
#define DMA_HTIF0 (1 << 4)
/* This bit is set by hardware. It is cleared by software writing 1 to the 
   corresponding bit in the DMA_LIFCR register.
	0: No half transfer event on stream x
	1: A half transfer event occurred on stream x */

/* Stream x transfer error interrupt flag (x=3..0) */
#define DMA_TEIF3 (1 << 25)
#define DMA_TEIF2 (1 << 19)
#define DMA_TEIF1 (1 << 9)
#define DMA_TEIF0 (1 << 3)
/* This bit is set by hardware. It is cleared by software writing 1 to the 
   corresponding bit in the DMA_LIFCR register.
	0: No transfer error on stream x
	1: A transfer error occurred on stream x */

/* Stream x direct mode error interrupt flag (x=3..0) */
#define DMA_DMEIF3 (1 << 24)
#define DMA_DMEIF2 (1 << 18)
#define DMA_DMEIF1 (1 << 8)
#define DMA_DMEIF0 (1 << 2)
/* This bit is set by hardware. It is cleared by software writing 1 to the 
   corresponding bit in the DMA_LIFCR register.
	0: No Direct Mode Error on stream x
	1: A Direct Mode Error occurred on stream x */

/* Bits 23, 17, 7, 1 Reserved, always read as 0 */

/* Stream x FIFO error interrupt flag (x=3..0) */
#define DMA_FEIF3 (1 << 22)
#define DMA_FEIF2 (1 << 16)
#define DMA_FEIF1 (1 << 6)
#define DMA_FEIF0 (1 << 0)
/* This bit is set by hardware. It is cleared by software writing 1 to the 
   corresponding bit in the DMA_LIFCR register.
	0: No FIFO Error event on stream x
	1: A FIFO Error event occurred on stream x */

/* DMA high interrupt status register */
#define STM32F_DMA_HISR 0x004

/* Bits 31:28, 15:12 Reserved, always read as 0. */

/* Stream x transfer complete interrupt flag (x=7..4) */
#define DMA_TCIF7 (1 << 27)
#define DMA_TCIF6 (1 << 21)
#define DMA_TCIF5 (1 << 11)
#define DMA_TCIF4 (1 << 5)
/* This bit is set by hardware. It is cleared by software writing 1 to the 
   corresponding bit in the DMA_HIFCR register.
	0: No transfer complete event on stream x
	1: A transfer complete event occurred on stream x */

/* Stream x half transfer interrupt flag (x=7..4) */
#define DMA_HTIF7 (1 << 26)
#define DMA_HTIF6 (1 << 20)
#define DMA_HTIF5 (1 << 10)
#define DMA_HTIF4 (1 << 4)
/* This bit is set by hardware. It is cleared by software writing 1 to the 
   corresponding bit in the DMA_HIFCR register.
	0: No half transfer event on stream x
	1: A half transfer event occurred on stream x */

/* Stream x transfer error interrupt flag (x=7..4) */
#define DMA_TEIF7 (1 << 25)
#define DMA_TEIF6 (1 << 19)
#define DMA_TEIF5 (1 << 9)
#define DMA_TEIF4 (1 << 3)
/* This bit is set by hardware. It is cleared by software writing 1 to the 
   corresponding bit in the DMA_HIFCR register.
	0: No transfer error on stream x
	1: A transfer error occurred on stream x */

/* Stream x direct mode error interrupt flag (x=7..4) */
#define DMA_DMEIF7 (1 << 24)
#define DMA_DMEIF6 (1 << 18)
#define DMA_DMEIF5 (1 << 8)
#define DMA_DMEIF4 (1 << 2)

/* This bit is set by hardware. It is cleared by software writing 1 to the 
   corresponding bit in the DMA_HIFCR register.
	0: No Direct mode error on stream x
	1: A Direct mode error occurred on stream x */

/* Bits 23, 17, 7, 1 Reserved, always read as 0 */

/* Stream x FIFO error interrupt flag (x=7..4) */
#define DMA_FEIF7 (1 << 22)
#define DMA_FEIF6 (1 << 16)
#define DMA_FEIF5 (1 << 6)
#define DMA_FEIF4 (1 << 0)

/* This bit is set by hardware. It is cleared by software writing 1 to the 
   corresponding bit in the DMA_HIFCR register.
	0: No FIFO error event on stream x
	1: A FIFO error event occurred on stream x */

/* DMA low interrupt flag clear register */
#define STM32F_DMA_LIFCR 0x008

/* Bits 31:28, 15:12 Reserved, always read as 0. */

/* Stream x clear transfer complete interrupt flag (x = 3..0) */
#define DMA_CTCIF3 (1 << 27)
#define DMA_CTCIF2 (1 << 21)
#define DMA_CTCIF1 (1 << 11)
#define DMA_CTCIF0 (1 << 5)
/* This bit is set and cleared by software.
	0: No effect
	1: Clears the corresponding TCIFx flag in the DMA_LISR register */

/* Stream x clear half transfer interrupt flag (x = 3..0) */
#define DMA_CHTIF3 (1 << 26)
#define DMA_CHTIF2 (1 << 20)
#define DMA_CHTIF1 (1 << 10)
#define DMA_CHTIF0 (1 << 4)
/* This bit is set and cleared by software.
	0: No effect
	1: Clears the corresponding HTIFx flag in the DMA_LISR register */

/* Stream x clear transfer error interrupt flag (x = 3..0) */
#define DMA_CTEIF3 (1 << 25)
#define DMA_CTEIF2 (1 << 19)
#define DMA_CTEIF1 (1 << 9)
#define DMA_CTEIF0 (1 << 3)
/* This bit is set and cleared by software.
	0: No effect
	1: Clears the corresponding TEIFx flag in the DMA_LISR register */

/* Stream x clear direct mode error interrupt flag (x = 3..0) */
#define DMA_CDMEIF3 (1 << 24)
#define DMA_CDMEIF2 (1 << 18)
#define DMA_CDMEIF1 (1 << 8)
#define DMA_CDMEIF0 (1 << 2)
/* This bit is set and cleared by software.
	0: No effect
	1: Clears the corresponding DMEIFx flag in the DMA_LISR register */

/* Bits 23, 17, 7, 1 Reserved, always read as 0. */

/* Stream x clear FIFO error interrupt flag (x = 3..0) */
#define DMA_CFEIF3 (1 << 22)
#define DMA_CFEIF2 (1 << 16)
#define DMA_CFEIF1 (1 << 6)
#define DMA_CFEIF0 (1 << 0)
/* This bit is set and cleared by software.
	0: No effect
	1: Clears the corresponding CFEIFx flag in the DMA_LISR register */

/* DMA high interrupt flag clear register */
#define STM32F_DMA_HIFCR 0x00c

/* Bits 31:28, 15:12 Reserved, always read as 0. */

/* Stream x clear transfer complete interrupt flag (x = 7..4) */
#define DMA_CTCIF7 (1 << 27)
#define DMA_CTCIF6 (1 << 21)
#define DMA_CTCIF5 (1 << 11)
#define DMA_CTCIF4 (1 << 5)
/* This bit is set and cleared by software.
	0: No effect
	1: Clears the corresponding TCIFx flag in the DMA_HISR register */

/* Stream x clear half transfer interrupt flag (x = 7..4) */
#define DMA_CHTIF7 (1 << 26)
#define DMA_CHTIF6 (1 << 20)
#define DMA_CHTIF5 (1 << 10)
#define DMA_CHTIF4 (1 << 4)
/* This bit is set and cleared by software.
	0: No effect
	1: Clears the corresponding HTIFx flag in the DMA_HISR register */

