bobmittmann/thinkos/sdk/include/stm32f/stm32f-dma.h
/* Stream x clear transfer error interrupt flag (x = 7..4) */
#define DMA_CTEIF7 (1 << 25)
#define DMA_CTEIF6 (1 << 19)
#define DMA_CTEIF5 (1 << 9)
#define DMA_CTEIF4 (1 << 3)
/* This bit is set and cleared by software.
	0: No effect
	1: Clears the corresponding TEIFx flag in the DMA_HISR register */

/* Stream x clear direct mode error interrupt flag (x = 7..4) */
#define DMA_CDMEIF7 (1 << 24)
#define DMA_CDMEIF6 (1 << 18)
#define DMA_CDMEIF5 (1 << 8)
#define DMA_CDMEIF4 (1 << 2)
/* This bit is set and cleared by software.
	0: No effect
	1: Clears the corresponding DMEIFx flag in the DMA_HISR register */

/* Bits 23, 17, 7, 1 Reserved, always read as 0 */

/* Stream x clear FIFO error interrupt flag (x = 7..4) */
#define DMA_CFEIF7 (1 << 22)
#define DMA_CFEIF6 (1 << 16)
#define DMA_CFEIF5 (1 << 6)
#define DMA_CFEIF4 (1 << 0)
/* This bit is set and cleared by software.
	0: No effect
	1: Clears the corresponding CFEIFx flag in the DMA_HISR register */

/*	DMA stream x configuration register */
#define STM32F_DMA_S0CR (0x010 + 0x018 * 0)
#define STM32F_DMA_S1CR (0x010 + 0x018 * 1)
#define STM32F_DMA_S2CR (0x010 + 0x018 * 2)
#define STM32F_DMA_S3CR (0x010 + 0x018 * 3)
#define STM32F_DMA_S4CR (0x010 + 0x018 * 4)
#define STM32F_DMA_S5CR (0x010 + 0x018 * 5)
#define STM32F_DMA_S6CR (0x010 + 0x018 * 6)
#define STM32F_DMA_S7CR (0x010 + 0x018 * 7)

/* [31..28] Reserved, always read as 0. */

/* Bits [27..25] - Channel selection */
#define DMA_CHSEL_MSK (((1 << (2 + 1)) - 1) << 25)
#define DMA_CHSEL_SET(VAL) (((VAL) << 25) & DMA_CHSEL_MSK)
#define DMA_CHSEL_GET(REG) (((REG) & DMA_CHSEL_MSK) >> 25)
/* These bits are set and cleared by software.
	000: channel 0 selected
	001: channel 1 selected
	010: channel 2 selected
	011: channel 3 selected
	100: channel 4 selected
	101: channel 5 selected
	110: channel 6 selected
	111: channel 7 selected
	These bits are protected and can be written only if EN is ‘0’ */

/* Bits [24..23] - Memory burst transfer configuration */
#define DMA_MBURST_MSK (((1 << (1 + 1)) - 1) << 23)
#define DMA_MBURST_SET(VAL) (((VAL) << 23) & DMA_MBURST_MSK)
#define DMA_MBURST_GET(REG) (((REG) & DMA_MBURST_MSK) >> 23)
#define DMA_MBURST_1 (0 << 23)
#define DMA_MBURST_4 (1 << 23)
#define DMA_MBURST_8 (2 << 23)
#define DMA_MBURST_16 (3 << 23)
/* These bits are set and cleared by software.
	00: single transfer
	01: INCR4 (incremental burst of 4 beats)
	10: INCR8 (incremental burst of 8 beats)
	11: INCR16 (incremental burst of 16 beats)
	These bits are protected and can be written only if EN is ‘0’
	In Direct mode, these bits are forced to 0x0 by hardware as soon 
	as bit EN= '1'. */

/* Bits [22..21] - Peripheral burst transfer configuration */
#define DMA_PBURST_MSK (((1 << (1 + 1)) - 1) << 21)
#define DMA_PBURST_SET(VAL) (((VAL) << 21) & DMA_PBURST_MSK)
#define DMA_PBURST_GET(REG) (((REG) & DMA_PBURST_MSK) >> 21)
#define DMA_PBURST_1 (0 << 23)
#define DMA_PBURST_4 (1 << 23)
#define DMA_PBURST_8 (2 << 23)
#define DMA_PBURST_16 (3 << 23)
/* These bits are set and cleared by software.
	00: single transfer
	01: INCR4 (incremental burst of 4 beats)
	10: INCR8 (incremental burst of 8 beats)
	11: INCR16 (incremental burst of 16 beats)
	These bits are protected and can be written only if EN is ‘0’
	In Direct mode, these bits are forced to 0x0 by hardware. */

/* Bit 20 Reserved. */

/* Bit 19 - Current target (only in double buffer mode) */
#define DMA_CT (1 << 19)
#define DMA_CT_M0AR (0 << 19)
#define DMA_CT_M1AR (1 << 19)
/* This bits is set and cleared by hardware. It can also be written by software.
	0: The current target memory is Memory 0 (addressed by the 
	DMA_SxM0AR pointer)
	1: The current target memory is Memory 1 (addressed by the 
	DMA_SxM1AR pointer)
	This bit can be written only if EN is ‘0’ to indicate the target 
	memory area of the first transfer.
	Once the stream is enabled, this bit operates as a status flag 
	indicating which memory area is the current target. */

/* Bit 18 - Double buffer mode */
#define DMA_DBM (1 << 18)
/* This bits is set and cleared by software.
	0: No buffer switching at the end of transfer
	1: Memory target switched at the end of the DMA transfer
	This bit is protected and can be written only if EN is ‘0’. */

/* Bits [17..16] - Priority level */
#define DMA_PL_MSK (((1 << (1 + 1)) - 1) << 16)
#define DMA_PL_SET(VAL) (((VAL) << 16) & DMA_PL_MSK)
#define DMA_PL_GET(REG) (((REG) & DMA_PL_MSK) >> 16)
/* These bits are set and cleared by software.
	00: Low
	01: Medium
	10: High
	11: Very high
	These bits are protected and can be written only if EN is ‘0’. */

/* Bit 15 - Peripheral increment offset size */
#define DMA_PINCOS (1 << 15)
/* This bit is set and cleared by software
	0: The offset size for the peripheral address calculation is 
	linked to the PSIZE
	1: The offset size for the peripheral address calculation is 
	fixed to 4 (32-bit alignment).
	This bit has no meaning if bit PINC = '0'.
	This bit is protected and can be written only if EN = '0'.
	This bit is forced low by hardware when the stream is enabled (bit EN = '1')
	if the direct mode is selected or if PBURST are different from “00”. */

/* Bits [14..13] - Memory data size */
#define DMA_MSIZE_MSK (((1 << (1 + 1)) - 1) << 13)
#define DMA_MSIZE_SET(VAL) (((VAL) << 13) & DMA_MSIZE_MSK)
#define DMA_MSIZE_GET(REG) (((REG) & DMA_MSIZE_MSK) >> 13)
#define DMA_MSIZE_8 (0 << 13)
#define DMA_MSIZE_16 (1 << 13)
#define DMA_MSIZE_32 (2 << 13)
/* These bits are set and cleared by software.
	00: byte (8-bit)
	01: half-word (16-bit)
	10: word (32-bit)
	11: reserved
	These bits are protected and can be written only if EN is ‘0’.
	In Direct mode, MSIZE is forced by hardware to the same value as 
	PSIZE as soon as bit EN = '1'. */

/* Bits [12..11] - Peripheral data size */
#define DMA_PSIZE_MSK (((1 << (1 + 1)) - 1) << 11)
#define DMA_PSIZE_SET(VAL) (((VAL) << 11) & DMA_PSIZE_MSK)
#define DMA_PSIZE_GET(REG) (((REG) & DMA_PSIZE_MSK) >> 11)
#define DMA_PSIZE_8 (0 << 11)
#define DMA_PSIZE_16 (1 << 11)
#define DMA_PSIZE_32 (2 << 11)
/* These bits are set and cleared by software.
	00: Byte (8-bit)
	01: Half-word (16-bit)
	10: Word (32-bit)
	11: reserved
	These bits are protected and can be written only if EN is ‘0’ */

/* Bit 10 - Memory increment mode */
#define DMA_MINC (1 << 10)
/* This bit is set and cleared by software.
	0: Memory address pointer is fixed
	1: Memory address pointer is incremented after each data 
	transfer (increment is done according to MSIZE)
	This bit is protected and can be written only if EN is ‘0’. */

/* Bit 9 - Peripheral increment mode */
#define DMA_PINC (1 << 9)
/* This bit is set and cleared by software.
	0: Peripheral address pointer is fixed
	1: Peripheral address pointer is incremented after each data 
	transfer (increment is done according to PSIZE)
	This bit is protected and can be written only if EN is ‘0’. */

