bobmittmann/thinkos/sdk/include/stm32f/stm32f-dma.h
/* Bit 8 - Circular mode */
#define DMA_CIRC (1 << 8)
/* This bit is set and cleared by software and can be cleared by hardware.
	0: Circular mode disabled
	1: Circular mode enabled
	When the peripheral is the flow controller (bit PFCTRL=1) and the 
	stream is enabled (bit EN=1), then this bit is automatically forced 
	by hardware to 0.
	It is automatically forced by hardware to 1 if the DBM bit is set, 
	as soon as the stream is enabled (bit EN ='1'). */

/* Bits [7..6] - Data transfer direction */
#define DMA_DIR_MSK (((1 << (1 + 1)) - 1) << 6)
#define DMA_DIR_SET(VAL) (((VAL) << 6) & DMA_DIR_MSK)
#define DMA_DIR_GET(REG) (((REG) & DMA_DIR_MSK) >> 6)
#define DMA_DIR_PTM (0 << 6)
#define DMA_DIR_MTP (1 << 6)
#define DMA_DIR_MTM (2 << 6)
/* These bits are set and cleared by software.
	00: Peripheral-to-memory
	01: Memory-to-peripheral
	10: Memory-to-memory
	11: reserved
	These bits are protected and can be written only if EN is ‘0’. */

/* Bit 5 - Peripheral flow controller */
#define DMA_PFCTRL (1 << 5)
/* This bit is set and cleared by software.
	0: The DMA is the flow controller
	1: The peripheral is the flow controller
	This bit is protected and can be written only if EN is ‘0’.
	When the memory-to-memory mode is selected (bits DIR[1:0]=10), 
	then this bit is automatically forced to 0 by hardware. */

/* Bit 4 - Transfer complete interrupt enable */
#define DMA_TCIE (1 << 4)
/* This bit is set and cleared by software.
	0: TC interrupt disabled
	1: TC interrupt enabled */

/* Bit 3 - Half transfer interrupt enable */
#define DMA_HTIE (1 << 3)
/* This bit is set and cleared by software.
	0: HT interrupt disabled
	1: HT interrupt enabled */

/* Bit 2 - Transfer error interrupt enable */
#define DMA_TEIE (1 << 2)
/* This bit is set and cleared by software.
	0: TE interrupt disabled
	1: TE interrupt enabled */

/* Bit 1 - Direct mode error interrupt enable */
#define DMA_DMEIE (1 << 1)
/* This bit is set and cleared by software.
	0: DME interrupt disabled
	1: DME interrupt enabled */

/* Bit 0 - Stream enable / flag stream ready when read low */
#define DMA_EN (1 << 0)
/* This bit is set and cleared by software.
	0: Stream disabled
	1: Stream enabled
	This bit may be cleared by hardware:
	– on a DMA end of transfer (stream ready to be configured)
	– if a transfer error occurs on the AHB master buses
	– when the FIFO threshold on memory AHB port is not compatible with the 
	size of the burst When this bit is read as 0, the software is allowed to 
	program the Configuration and FIFO bits registers. It is forbidden to 
	write these registers when the EN bit is read as 1. */


/* DMA stream x number of data register */
#define STM32F_DMA_S0NDTR (0x014 + 0x018 * 0)
#define STM32F_DMA_S1NDTR (0x014 + 0x018 * 1)
#define STM32F_DMA_S2NDTR (0x014 + 0x018 * 2)
#define STM32F_DMA_S3NDTR (0x014 + 0x018 * 3)
#define STM32F_DMA_S4NDTR (0x014 + 0x018 * 4)
#define STM32F_DMA_S5NDTR (0x014 + 0x018 * 5)
#define STM32F_DMA_S6NDTR (0x014 + 0x018 * 6)
#define STM32F_DMA_S7NDTR (0x014 + 0x018 * 7)

/* [31..16] Reserved, always read as 0. */

/* Bits [15..0] - Number of data items to transfer */
#define DMA_NDT_MSK (((1 << (15 + 1)) - 1) << 0)
#define DMA_NDT_SET(VAL) (((VAL) << 0) & DMA_NDT_MSK)
#define DMA_NDT_GET(REG) (((REG) & DMA_NDT_MSK) >> 0)
/* Number of data items to be transferred (0 up to 65535). This register can 
   be written only when the stream is disabled. When the stream is enabled, 
   this register is read-only, indicating the remaining data items to be 
   transmitted. This register decrements after each DMA transfer.
   Once the transfer has completed, this register can either stay at zero or 
   be reloaded automatically with the previously programmed value if the 
   stream is configured in Circular mode.
   If the value of this register is zero, no transaction can be served even 
   if the stream is enabled. */

/* DMA stream x peripheral address register */
#define STM32F_DMA_S0PAR (0x018 + 0x018 * 0)
#define STM32F_DMA_S1PAR (0x018 + 0x018 * 1)
#define STM32F_DMA_S2PAR (0x018 + 0x018 * 2)
#define STM32F_DMA_S3PAR (0x018 + 0x018 * 3)
#define STM32F_DMA_S4PAR (0x018 + 0x018 * 4)
#define STM32F_DMA_S5PAR (0x018 + 0x018 * 5)
#define STM32F_DMA_S6PAR (0x018 + 0x018 * 6)
#define STM32F_DMA_S7PAR (0x018 + 0x018 * 7)

/* Bits [31..0] - Peripheral address */
#define DMA_PAR_MSK (((1 << (31 + 1)) - 1) << 0)
#define DMA_PAR_SET(VAL) (((VAL) << 0) & DMA_PAR_MSK)
#define DMA_PAR_GET(REG) (((REG) & DMA_PAR_MSK) >> 0)
/* Base address of the peripheral data register from/to which the data will 
   be read/written. 
   These bits are write-protected and can be written only when 
   bit EN = '0' in the DMA_SxCR register. */

/*  DMA stream x memory 0 address register */
#define STM32F_DMA_S0M0AR (0x01c + 0x018 * 0)
#define STM32F_DMA_S1M0AR (0x01c + 0x018 * 1)
#define STM32F_DMA_S2M0AR (0x01c + 0x018 * 2)
#define STM32F_DMA_S3M0AR (0x01c + 0x018 * 3)
#define STM32F_DMA_S4M0AR (0x01c + 0x018 * 4)
#define STM32F_DMA_S5M0AR (0x01c + 0x018 * 5)
#define STM32F_DMA_S6M0AR (0x01c + 0x018 * 6)
#define STM32F_DMA_S7M0AR (0x01c + 0x018 * 7)

/* Bits [31..0] - Memory 0 address */
#define DMA_M0A_MSK (((1 << (31 + 1)) - 1) << 0)
#define DMA_M0A_SET(VAL) (((VAL) << 0) & DMA_M0A_MSK)
#define DMA_M0A_GET(REG) (((REG) & DMA_M0A_MSK) >> 0)
/* Base address of Memory area 0 from/to which the data will be read/written.
   These bits are write-protected. They can be written only if:
   – the stream is disabled (bit EN= '0' in the DMA_SxCR register) or
   – the stream is enabled (EN=’1’ in DMA_SxCR register) and bit CT = '1' 
   in the DMA_SxCR register (in Double buffer mode). */

/* DMA stream x memory 1 address register */
#define STM32F_DMA_S0M1AR (0x020 + 0x018 * 0)
#define STM32F_DMA_S1M1AR (0x020 + 0x018 * 1)
#define STM32F_DMA_S2M1AR (0x020 + 0x018 * 2)
#define STM32F_DMA_S3M1AR (0x020 + 0x018 * 3)
#define STM32F_DMA_S4M1AR (0x020 + 0x018 * 4)
#define STM32F_DMA_S5M1AR (0x020 + 0x018 * 5)
#define STM32F_DMA_S6M1AR (0x020 + 0x018 * 6)
#define STM32F_DMA_S7M1AR (0x020 + 0x018 * 7)

/* Bits [31..0] - Memory 1 address (used in case of Double buffer mode) */
#define DMA_M1A_MSK (((1 << (31 + 1)) - 1) << 0)
#define DMA_M1A_SET(VAL) (((VAL) << 0) & DMA_M1A_MSK)
#define DMA_M1A_GET(REG) (((REG) & DMA_M1A_MSK) >> 0)
/* Base address of Memory area 1 from/to which the data will be read/written.
   This register is used only for the Double buffer mode.
   These bits are write-protected. They can be written only if:
   – the stream is disabled (bit EN= '0' in the DMA_SxCR register) or
   – the stream is enabled (EN=’1’ in DMA_SxCR register) and bit CT = '0' 
   in the DMA_SxCR register. */

