bobmittmann/thinkos/sdk/include/stm32f/stm32f-dma.h
/* DMA stream x FIFO control register */
#define STM32F_DMA_S0FCR (0x24 + 0x018 * 0)
#define STM32F_DMA_S1FCR (0x24 + 0x018 * 1)
#define STM32F_DMA_S2FCR (0x24 + 0x018 * 2)
#define STM32F_DMA_S3FCR (0x24 + 0x018 * 3)
#define STM32F_DMA_S4FCR (0x24 + 0x018 * 4)
#define STM32F_DMA_S5FCR (0x24 + 0x018 * 5)
#define STM32F_DMA_S6FCR (0x24 + 0x018 * 6)
#define STM32F_DMA_S7FCR (0x24 + 0x018 * 7)

/* [31..8] Reserved, always read as 0. */

/* Bit 7 - FIFO error interrupt enable */
#define DMA_FEIE (1 << 7)
/* This bit is set and cleared by software.
	0: FE interrupt disabled
	1: FE interrupt enabled */

/* Bit 6 Reserved, always read as 0 */

/* Bits [5..3] - FIFO status */
#define DMA_FS_MSK (((1 << (2 + 1)) - 1) << 3)
#define DMA_FS_SET(VAL) (((VAL) << 3) & DMA_FS_MSK)
#define DMA_FS_GET(REG) (((REG) & DMA_FS_MSK) >> 3)
/* These bits are read-only.
	000: 0 < fifo_level < 1/4
	001: 1/4 ≤ fifo_level < 1/2
	010: 1/2 ≤ fifo_level < 3/4
	011: 3/4 ≤ fifo_level < full
	100: FIFO is empty
	101: FIFO is full
	others: no meaning 
	These bits are not relevant in the DIrect mode (DMDIS bit is zero). */

/* Bit 2 - Direct mode disable */
#define DMA_DMDIS (1 << 2)
/* This bit is set and cleared by software. It can be set by hardware.
	0: Direct mode enabled
	1: Direct mode disabled
	This bit is protected and can be written only if EN is ‘0’.
	This bit is set by hardware if the memory-to-memory mode is 
	selected (DIR bit in DMA_SxCR are “10”) and the EN bit in the DMA_SxCR 
	register is ‘1’ because the Direct mode is not
	allowed in the memory-to-memory configuration. */

/* Bits [1..0] - FIFO threshold selection */
#define DMA_FTH_MSK (((1 << (1 + 1)) - 1) << 0)
#define DMA_FTH_SET(VAL) (((VAL) << 0) & DMA_FTH_MSK)
#define DMA_FTH_GET(REG) (((REG) & DMA_FTH_MSK) >> 0)
#define DMA_FTH_1_4 (0 << 0)
#define DMA_FTH_1_2 (1 << 0)
#define DMA_FTH_1_3 (2 << 0)
#define DMA_FTH_FULL (3 << 0)
/* These bits are set and cleared by software.
	00: 1/4 full FIFO
	01: 1/2 full FIFO
	10: 3/4 full FIFO
	11: full FIFO
	These bits are not used in the Direct Mode when the DMIS value is zero.
	These bits are protected and can be written only if EN is ‘1’. */

#endif


#if defined(STM32F1X) || defined(STM32F3X) || defined(STM32L1X) || \
	defined(STM32L4X)

/* DMA interrupt status register */
#define STM32F_DMA_ISR 0x000

/* Bits 31:28 Reserved, must be kept at reset value.
Bits 27, 23, 19, 15,
11, 7, 3
TEIFx: Channel x transfer error flag (x = 1 ..7)
This bit is set by hardware. It is cleared by software writing 1 to the corresponding bit in the
DMA_IFCR register.
0: No transfer error (TE) on channel x
1: A transfer error (TE) occurred on channel x
Bits 26, 22, 18, 14,
10, 6, 2
HTIFx: Channel x half transfer flag (x = 1 ..7)
This bit is set by hardware. It is cleared by software writing 1 to the corresponding bit in the
DMA_IFCR register.
0: No half transfer (HT) event on channel x
1: A half transfer (HT) event occurred on channel x
Bits 25, 21, 17, 13,
9, 5, 1
TCIFx: Channel x transfer complete flag (x = 1 ..7)
This bit is set by hardware. It is cleared by software writing 1 to the corresponding bit in the
DMA_IFCR register.
0: No transfer complete (TC) event on channel x
1: A transfer complete (TC) event occurred on channel x
Bits 24, 20, 16, 12,
8, 4, 0
GIFx: Channel x global interrupt flag (x = 1 ..7)
This bit is set by hardware. It is cleared by software writing 1 to the corresponding bit in the
DMA_IFCR register.
0: No TE, HT or TC event on channel x
1: A TE, HT or TC event occurred on channel x */

#define DMA_TEIF7 (1 << 27)
#define DMA_HTIF7 (1 << 26)
#define DMA_TCIF7 (1 << 25)
#define DMA_GIF7  (1 << 24)

#define DMA_TEIF6 (1 << 23)
#define DMA_HTIF6 (1 << 22)
#define DMA_TCIF6 (1 << 21)
#define DMA_GIF6  (1 << 20)

#define DMA_TEIF5 (1 << 19)
#define DMA_HTIF5 (1 << 18)
#define DMA_TCIF5 (1 << 17)
#define DMA_GIF5  (1 << 16)

#define DMA_TEIF4 (1 << 15)
#define DMA_HTIF4 (1 << 14)
#define DMA_TCIF4 (1 << 13)
#define DMA_GIF4  (1 << 12)

#define DMA_TEIF3 (1 << 11)
#define DMA_HTIF3 (1 << 10)
#define DMA_TCIF3 (1 << 9)
#define DMA_GIF3  (1 << 8)

#define DMA_TEIF2 (1 << 7)
#define DMA_HTIF2 (1 << 6)
#define DMA_TCIF2 (1 << 5)
#define DMA_GIF2  (1 << 4)

#define DMA_TEIF1 (1 << 3)
#define DMA_HTIF1 (1 << 2)
#define DMA_TCIF1 (1 << 1)
#define DMA_GIF1  (1 << 0)

/* DMA interrupt flag clear register */
#define STM32F_DMA_IFCR 0x004

/*
Bits 31:28 Reserved, must be kept at reset value.
Bits 27, 23, 19, 15,
11, 7, 3
CTEIFx: Channel x transfer error clear (x = 1 ..7)
This bit is set and cleared by software.
0: No effect
1: Clears the corresponding TEIF flag in the DMA_ISR register
Bits 26, 22, 18, 14,
10, 6, 2
CHTIFx: Channel x half transfer clear (x = 1 ..7)
This bit is set and cleared by software.
0: No effect
1: Clears the corresponding HTIF flag in the DMA_ISR register
Bits 25, 21, 17, 13,
9, 5, 1
CTCIFx: Channel x transfer complete clear (x = 1 ..7)
This bit is set and cleared by software.
0: No effect
1: Clears the corresponding TCIF flag in the DMA_ISR register
Bits 24, 20, 16, 12,
8, 4, 0
CGIFx: Channel x global interrupt clear (x = 1 ..7)
This bit is set and cleared by software.
0: No effect
1: Clears the GIF, TEIF, HTIF and TCIF flags in the DMA_ISR register
*/

#define DMA_CTEIF7 (1 << 27)
#define DMA_CHTIF7 (1 << 26)
#define DMA_CTCIF7 (1 << 25)
#define DMA_CGIF7  (1 << 24)

#define DMA_CTEIF6 (1 << 23)
#define DMA_CHTIF6 (1 << 22)
#define DMA_CTCIF6 (1 << 21)
#define DMA_CGIF6  (1 << 20)

#define DMA_CTEIF5 (1 << 19)
#define DMA_CHTIF5 (1 << 18)
#define DMA_CTCIF5 (1 << 17)
#define DMA_CGIF5  (1 << 16)

#define DMA_CTEIF4 (1 << 15)
#define DMA_CHTIF4 (1 << 14)
#define DMA_CTCIF4 (1 << 13)
#define DMA_CGIF4  (1 << 12)

#define DMA_CTEIF3 (1 << 11)
#define DMA_CHTIF3 (1 << 10)
#define DMA_CTCIF3 (1 << 9)
#define DMA_CGIF3  (1 << 8)

#define DMA_CTEIF2 (1 << 7)
#define DMA_CHTIF2 (1 << 6)
#define DMA_CTCIF2 (1 << 5)
#define DMA_CGIF2  (1 << 4)

#define DMA_CTEIF1 (1 << 3)
#define DMA_CHTIF1 (1 << 2)
#define DMA_CTCIF1 (1 << 1)
#define DMA_CGIF1  (1 << 0)

