bobmittmann/thinkos/sdk/include/stm32f/stm32f-dma.h
/*	DMA channel x configuration register */
#define STM32F_DMA_CCR1 (0x08 + 20 * 0)
#define STM32F_DMA_CCR2 (0x08 + 20 * 1)
#define STM32F_DMA_CCR3 (0x08 + 20 * 2)
#define STM32F_DMA_CCR4 (0x08 + 20 * 3)
#define STM32F_DMA_CCR5 (0x08 + 20 * 4)
#define STM32F_DMA_CCR6 (0x08 + 20 * 5)
#define STM32F_DMA_CCR7 (0x08 + 20 * 6)

/* Bits 31:15 Reserved, must be kept at reset value. */

/*Bit 14 MEM2MEM: Memory to memory mode */
#define DMA_MEM2MEM (1 << 14)
/* This bit is set and cleared by software.
0: Memory to memory mode disabled
1: Memory to memory mode enabled */

/* Bits 13:12 PL[1:0]: Channel priority level */
#define DMA_PL_LOW       (0 << 12)
#define DMA_PL_MEDIUM    (1 << 12)
#define DMA_PL_HIGH      (2 << 12)
#define DMA_PL_VERY_HIGH (2 << 12)
/*These bits are set and cleared by software.
00: Low
01: Medium
10: High
11: Very high */

/* Bits 11:10 MSIZE[1:0]: Memory size */
#define DMA_MSIZE_8  (0 << 10)
#define DMA_MSIZE_16 (1 << 10)
#define DMA_MSIZE_32 (2 << 10)
/* These bits are set and cleared by software.
00: 8-bits
01: 16-bits
10: 32-bits
11: Reserved */

/* Bits 9:8 PSIZE[1:0]: Peripheral size */
#define DMA_PSIZE_8  (0 << 8)
#define DMA_PSIZE_16 (1 << 8)
#define DMA_PSIZE_32 (2 << 8)
/* These bits are set and cleared by software.
00: 8-bits
01: 16-bits
10: 32-bits
11: Reserved */

/* Bit 7 MINC: Memory increment mode */
#define DMA_MINC (1 << 7)
/* This bit is set and cleared by software.
0: Memory increment mode disabled
1: Memory increment mode enabled */

/* Bit 6 PINC: Peripheral increment mode */
#define DMA_PINC (1 << 6)
/* This bit is set and cleared by software.
0: Peripheral increment mode disabled
1: Peripheral increment mode enabled */

/* Bit 5 CIRC: Circular mode */
#define DMA_CIRC (1 << 5)
/* This bit is set and cleared by software.
0: Circular mode disabled
1: Circular mode enabled */

/* Bit 4 DIR: Data transfer direction */
#define DMA_DIR (1 << 4)
#define DMA_DIR_PTM (0 << 4)
#define DMA_DIR_MTP (1 << 4)
/* This bit is set and cleared by software.
0: Read from peripheral
1: Read from memory */

/* Bit 3 TEIE: Transfer error interrupt enable */
#define DMA_TEIE (1 << 3)
/* This bit is set and cleared by software.
0: TE interrupt disabled
1: TE interrupt enabled */

/* Bit 2 HTIE: Half transfer interrupt enable */
#define DMA_HTIE (1 << 2)
/* This bit is set and cleared by software.
0: HT interrupt disabled
1: HT interrupt enabled */

/* Bit 1 TCIE: Transfer complete interrupt enable */
#define DMA_TCIE (1 << 1)
/* This bit is set and cleared by software.
0: TC interrupt disabled
1: TC interrupt enabled */

/* Bit 0 EN: Channel enable */
#define DMA_EN (1 << 0)
/* This bit is set and cleared by software.
0: Channel disabled
1: Channel enabled*/

/*	DMA channel x number of data register */
#define STM32F_DMA_CNDTR1 (0x0C + 20 * 0)
#define STM32F_DMA_CNDTR2 (0x0C + 20 * 1)
#define STM32F_DMA_CNDTR3 (0x0C + 20 * 2)
#define STM32F_DMA_CNDTR4 (0x0C + 20 * 3)
#define STM32F_DMA_CNDTR5 (0x0C + 20 * 4)
#define STM32F_DMA_CNDTR6 (0x0C + 20 * 5)
#define STM32F_DMA_CNDTR7 (0x0C + 20 * 6)

/*	DMA channel x peripheral address register */
#define STM32F_DMA_CPAR1 (0x10 + 20 * 0)
#define STM32F_DMA_CPAR2 (0x10 + 20 * 1)
#define STM32F_DMA_CPAR3 (0x10 + 20 * 2)
#define STM32F_DMA_CPAR4 (0x10 + 20 * 3)
#define STM32F_DMA_CPAR5 (0x10 + 20 * 4)
#define STM32F_DMA_CPAR6 (0x10 + 20 * 5)
#define STM32F_DMA_CPAR7 (0x10 + 20 * 6)

/*	DMA channel x memory address register */
#define STM32F_DMA_CMAR1 (0x14 + 20 * 0)
#define STM32F_DMA_CMAR2 (0x14 + 20 * 1)
#define STM32F_DMA_CMAR3 (0x14 + 20 * 2)
#define STM32F_DMA_CMAR4 (0x14 + 20 * 3)
#define STM32F_DMA_CMAR5 (0x14 + 20 * 4)
#define STM32F_DMA_CMAR6 (0x14 + 20 * 5)
#define STM32F_DMA_CMAR7 (0x14 + 20 * 6)

#define STM32_DMA_CHANNEL1 0
#define STM32_DMA_CHANNEL2 1
#define STM32_DMA_CHANNEL3 2
#define STM32_DMA_CHANNEL4 3
#define STM32_DMA_CHANNEL5 4
#define STM32_DMA_CHANNEL6 5
#define STM32_DMA_CHANNEL7 6

#endif

#if defined(STM32L4X)
/* ------------------------------------------------------------------------- */
/* DMA1 channel selection register - CSELR */
#define STM32_DMA1_CSELR 0x00a8

/* Bits [28..31] - Reserved, must be kept at reset value. */

/* Bits [24..27] - DMA channel 7 selection */
#define DMA1_C7S_MSK (0xf << 24)
#define DMA1_C7S_SET(VAL) (((VAL) << 24) & DMA1_C7S_MSK)
#define DMA1_C7S_GET(REG) (((REG) & DMA1_C7S_MSK) >> 24)
/* 0000: Reserved
   0001: Reserved
   0010: Channel 7 mapped on USART2_TX
   0011: Channel 7 mapped on I2C1_RX
   0100: Channel 7 mapped on TIM2_CH2/TIM2_CH4
   0101: Reserved
   0110: Reserved
   0111: Channel 7 mapped on TIM1_CH3 */

/* Bits [20..23] - DMA channel 6 selection */
#define DMA1_C6S_MSK (0xf << 20)
#define DMA1_C6S_SET(VAL) (((VAL) << 20) & DMA1_C6S_MSK)
#define DMA1_C6S_GET(REG) (((REG) & DMA1_C6S_MSK) >> 20)
/* 0000: Reserved
   0001: Reserved
   0010: Channel 6 mapped on USART2_RX
   0011: Channel 6 mapped on I2C1_TX
   0100: Channel 6 mapped on TIM16_CH1/TIM16_UP
   0101: Channel 6 mapped on TIM3_CH1/TIM3_TRIG. Available on STM32L45xxx and
   STM32L46xxx devices only.
   0110: Reserved
   0111: Channel 6 mapped on TIM1_UP
   others: Reserved */
#define DMA1_C6S_USART2_RX (DMA1_C6S_SET(0x2))

/* Bits [16..19] - DMA channel 5 selection */
#define DMA1_C5S_MSK (0xf << 16)
#define DMA1_C5S_SET(VAL) (((VAL) << 16) & DMA1_C5S_MSK)
#define DMA1_C5S_GET(REG) (((REG) & DMA1_C5S_MSK) >> 16)
/* 0000: Reserved
   0001: Channel 5 mapped on SPI2_TX
   0010: Channel 5 mapped on USART1_RX
   0011: Channel 5 mapped on I2C2_RX
   0100: Channel 5 mapped on TIM2_CH1
   0101: Channel 5 mapped on QUADSPI
   0110: Reserved
   0111: Channel 5 mapped on TIM15_CH1/TIM15_UP/TIM15_TRIG/TIM15_COM
   others: Reserved */

/* Bits [12..15] - DMA channel 4 selection */
#define DMA1_C4S_MSK (0xf << 12)
#define DMA1_C4S_SET(VAL) (((VAL) << 12) & DMA1_C4S_MSK)
#define DMA1_C4S_GET(REG) (((REG) & DMA1_C4S_MSK) >> 12)
/* 0000: Reserved
   0001: Channel 4 mapped on SPI2_RX
   0010: Channel 4 mapped on USART1_TX
   0011: Channel 4 mapped on I2C2_TX
   0100: Reserved
   0101: Channel 4 mapped on TIM7_UP/DAC2. Available on STM32L43xxx and
   STM32L44xxx devices only.
   0110: Reserved
   0111: Channel 4 mapped on TIM1_CH4/TIM1_TRIG/TIM1_COM
   others: Reserved */
#define DMA1_C4S_TIM7_UP_DAC2 (0x5 << 12)

